app/Helpers/viholder_helper.php

SELECT *
FROM `favorites`
WHERE `user_id` = '1'
 LIMIT 1
---
function is_favorite($contract_id=0)
  {

	$favorite_id=array();

	$id = logged('id');

	$array = array('user_id'=> $id);

	$datas['favorites']=  model('App\Models\FavoritesModel')->where($array)->first();