app/Models/WalletModel.php

SELECT *
FROM `wallets`
WHERE `userID` = '1'
AND `network` = 'viholder'
---
   function get_cash_available($id)
    {
      $array = array('userID' => $id, 'network' => 'viholder', );
      $wallets = $this->where($array)->findall();